20-Rails-Associations/one-many/app/views/corgis/_form.html.erb

SELECT "owners".* FROM "owners"
---
<%= f.label 'Owners' %>
<%= f.collection_select :owner_id, Owner.all, :id, :name, {:prompt => "Please select the owner"} %>