20-Rails-Associations/one-many/app/controllers/corgis_controller.rb

SELECT "corgis".* FROM "corgis"
---
    def index
    @corgis = Corgi.all

INSERT INTO "corgis" ("name", "owner_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Corgi6"], ["owner_id", 3], ["created_at", "2019-04-30 16:06:14.358439"], ["updated_at", "2019-04-30 16:06:14.358439"]]
---
    def create
        @corgi = Corgi.create(corgi_params)

UPDATE "corgis" SET "name" = ?, "updated_at" = ? WHERE "corgis"."id" = ?  [["name", "Justin is the coolest"], ["updated_at", "2019-04-29 15:22:35.978564"], ["id", 4]]
---
    def update
    #  @corgi = Corgi.find(params[:id])
     @corgi.update(corgi_params)

DELETE FROM "corgis" WHERE "corgis"."id" = ?  [["id", 5]]
---
    def destroy
        # corgi = Corgi.find(params[:id])
        @corgi.destroy