41-JWT-Auth/server/app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]
---
      def current_user
        # byebug
        if decoded_token

          user_id = decoded_token["user_id"]

          User.find(user_id)