20-Rails-Associations/many-many/app/views/corgis/show.html.erb


<% @corgi.owners.each do |owner| %>
---
SELECT "owners".* FROM "owners" INNER JOIN "friendships" ON "owners"."id" = "friendships"."owner_id" WHERE "friendships"."corgi_id" = ?  [["corgi_id", 6]]