21-Rails-Validations/app/controllers/corgis_controller.rb

SELECT "corgis".* FROM "corgis"
---
    def index
    @corgis = Corgi.all

SELECT "owners".* FROM "owners"
---
    def new
        @corgi = Corgi.new
        @owners = Owner.all

INSERT INTO "corgis" ("name", "age", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "fffs"], ["age", 25], ["created_at", "2019-05-01 14:23:49.760553"], ["updated_at", "2019-05-01 14:23:49.760553"]]
---
    def create

        @corgi = Corgi.new(corgi_params)

        if @corgi.valid?
            @corgi.save

SELECT "owners".* FROM "owners"
---
    def edit
        @owners = Owner.all

UPDATE "corgis" SET "name" = ?, "updated_at" = ? WHERE "corgis"."id" = ?  [["name", "Justin is the coolest"], ["updated_at", "2019-04-29 15:22:35.978564"], ["id", 4]]
---
    def update
    #  @corgi = Corgi.find(params[:id])
     @corgi.update(corgi_params)

DELETE FROM "corgis" WHERE "corgis"."id" = ?  [["id", 5]]
---
    def destroy
        # corgi = Corgi.find(params[:id])
        @corgi.destroy