21-Rails-Validations/app/views/owners/show.html.erb

SELECT "corgis".* FROM "corgis" INNER JOIN "friendships" ON "corgis"."id" = "friendships"."corgi_id" WHERE "friendships"."owner_id" = ?  [["owner_id", 4]]
---
<p>Corgis:</p>
<% @owner.corgis.each do |corgi| %>