20-Rails-Associations/many-many/app/controllers/owners_controller.rb

SELECT "owners".* FROM "owners"
---
    def index
     @owners = Owner.all

SELECT "corgis".* FROM "corgis"
---
    def new
        @owner = Owner.new
        @corgis = Corgi.all

INSERT INTO "owners" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Vidhi"], ["created_at", "2019-04-30 19:15:26.619776"], ["updated_at", "2019-04-30 19:15:26.619776"]]
---
    def create
        @owner = Owner.create(owner_params)