22-sessions-and-cookies/app/controllers/responses_controller.rb

SELECT  "questions".* FROM "questions" ORDER BY RANDOM() LIMIT ?  [["LIMIT", 1]]
---
    def define_question
        @question = Question.order("RANDOM()").limit(1)[0]

INSERT INTO "responses" ("question_id", "answer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["question_id", 9], ["answer_id", 36], ["created_at", "2019-05-06 18:36:29.085280"], ["updated_at", "2019-05-06 18:36:29.085280"]]
---
    def create
        if session[:number_correct] == nil
            session[:number_correct] = 0
        end
        response = Response.create(response_params)