18-Intro-rails/app/controllers/dogs_controller.rb

SELECT "dogs".* FROM "dogs"
---
  def index
    @dogs = Dog.all