21-Rails-Validations/app/views/corgis/show.html.erb

<p>Owners:</p>
<% @corgi.owners.each do |owner| %>
---
SELECT "owners".* FROM "owners" INNER JOIN "friendships" ON "owners"."id" = "friendships"."owner_id" WHERE "friendships"."corgi_id" = ?  [["corgi_id", 6]]