23-rails-auth/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
        def show

            if logged_in?
                @user = User.find(session[:user_id])

INSERT INTO "users" ("username", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?)
---
        def create
            @user = User.new(user_params)

            if @user.valid?
                @user.save